Autodesk.Revit.DB.Structure.RebarShape.SetEndTreatmentTypeId(Autodesk.Revit.DB.ElementId,System.Int32)
Sets the EndTreatmentType id at the specified rebar shape end.
endTreatmentId:
The id of an EndTreatmentType element, or invalidElementId if the rebar shape should have no end treatment at the specified end.
iEnd:
0 for the start end treatment, 1 for the end end treatment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
iEnd not a valid shape end
-or-
the parameter endTreatmentId is not an EndTreatmentType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2017

Autodesk.Revit.DB.Structure.RebarShape.SetHookRotationAngle(System.Double,System.Int32)
Sets the out of plane hook rotation angle at the specified end.
hookRotationAngle:
The out of plane hook rotation angle at the specified end.
iEnd:
0 for the start , 1 for the end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
iEnd must be 0 or 1.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2021

Autodesk.Revit.DB.Structure.RebarShape.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarShapeDefinition,Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition,Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.StirrupTieAttachmentType,System.Int32,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Int32,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Int32,System.Double,System.Double,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Create a new instance of a Rebar Shape, which defines the shape of a rebar.
doc:
A document to contain the RebarShape.
definition:
The definition of the rebar shape, as a set of curves in a plane
driven by parameters.
multiplanarDefinition:
If not null, the created RebarShape will be a 3D shape. The shape
is built out of the planar RebarShapeDefinition, with additional
out-of-plane segments defined by the RebarShapeMultiplanarDefinition
object. Not supported in conjunction with RebarShapeDefinitionByArc
of type Spiral or LappedCircle.
style:
Whether the shape is to be used as a standard bar or a stirrup/tie.
attachmentType:
When the style is stirrup/tie, specify whether it will attach to the
interior of cover (cover is measured to the stirrups), or to the
exterior of cover (cover is measured to the standard bars).
Ignored when the style is Standard.
startHookAngle:
The start hook angle, expressed as an integral number of degrees.
If 0, the shape will have no start hook. Common values are 0, 90, 135, and 180.
startHookOrientation:
The orientation of the start hook.
Ignored when startHookAngle is 0.
endHookAngle:
The end hook angle, expressed as an integral number of degrees.
If 0, the shape will have no end hook. Common values are 0, 90, 135, and 180.
endHookOrientation:
The orientation of the end hook.
Ignored when endHookAngle is 0.
higherEnd:
When the rebar crosses itself, one end will be "lifted" to avoid self-intersection.
Specify which end should be lifted: 0 for start, 1 for end.
hookRotationAngleAtStart:
The out of plane hook rotation angle at the start of the bar.
hookRotationAngleAtEnd:
The out of plane hook rotation angle at the end of the bar.
endTreatmentTypeIdAtStart:
The end treatment type id at the start of the bar.
endTreatmentTypeIdAtEnd:
The end treatment type id at the end of the bar.
Returns:
A new RebarShape instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
definition is linked to a Document other than doc.
-or-
A multiplanar definition is specified when the given RebarShapeDefinition
does not support it. The following RebarShapeDefinitions do not support
multiplanar: a simple line; spiral; lapped circle.
-or-
The DepthParamId property of multiplanarDefinition
is invalid or has not been added to definition.
-or-
the parameter endTreatmentTypeIdAtStart is not an EndTreatmentType element.
-or-
the parameter endTreatmentTypeIdAtEnd is not an EndTreatmentType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
startHookAngle must be at least 0 and no more than 180.
-or-
endHookAngle must be at least 0 and no more than 180.
-or-
higherEnd must be 0 or 1.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2021

Autodesk.Revit.DB.Structure.RebarShape.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarShapeDefinition,Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition,Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.StirrupTieAttachmentType,System.Int32,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Int32,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Int32)
Create a new instance of a Rebar Shape, which defines the shape of a rebar.
doc:
A document to contain the RebarShape.
definition:
The definition of the rebar shape, as a set of curves in a plane
driven by parameters.
multiplanarDefinition:
If not null, the created RebarShape will be a 3D shape. The shape
is built out of the planar RebarShapeDefinition, with additional
out-of-plane segments defined by the RebarShapeMultiplanarDefinition
object. Not supported in conjunction with RebarShapeDefinitionByArc
of type Spiral or LappedCircle.
style:
Whether the shape is to be used as a standard bar or a stirrup/tie.
attachmentType:
When the style is stirrup/tie, specify whether it will attach to the
interior of cover (cover is measured to the stirrups), or to the
exterior of cover (cover is measured to the standard bars).
Ignored when the style is Standard.
startHookAngle:
The start hook angle, expressed as an integral number of degrees.
If 0, the shape will have no start hook. Common values are 0, 90, 135, and 180.
startHookOrientation:
The orientation of the start hook.
Ignored when startHookAngle is 0.
endHookAngle:
The end hook angle, expressed as an integral number of degrees.
If 0, the shape will have no end hook. Common values are 0, 90, 135, and 180.
endHookOrientation:
The orientation of the end hook.
Ignored when endHookAngle is 0.
higherEnd:
When the rebar crosses itself, one end will be "lifted" to avoid self-intersection.
Specify which end should be lifted: 0 for start, 1 for end.
Returns:
A new RebarShape instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
definition is linked to a Document other than doc.
-or-
A multiplanar definition is specified when the given RebarShapeDefinition
does not support it. The following RebarShapeDefinitions do not support
multiplanar: a simple line; spiral; lapped circle.
-or-
The DepthParamId property of multiplanarDefinition
is invalid or has not been added to definition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
startHookAngle must be at least 0 and no more than 180.
-or-
endHookAngle must be at least 0 and no more than 180.
-or-
higherEnd must be 0 or 1.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2012